nxp-mcuxpresso/mcux-soc-svd/MCXN526T/MCXN526T_cm33_core1.xml
        <register>
          <name>ELS_AS_CFG0</name>
          <description>ELS AS Configuration</description>
          <addressOffset>0x9D0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xC0255</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFG_LC_STATE</name>
              <description>LC state configuration bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_LVD_CORE_RESET_ENABLED</name>
              <description>When SPC CORE LVD analog detector are turned on, and CORE LVD reset are enabled, this bit indicates state 1.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_LVD_CORE_IRQ_ENABLED</name>
              <description>When SPC CORE LVD analog detector are turned on, and CORE LVD IRQ are enabled, this bit indicates state 1.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_WDT0_ENABLED</name>
              <description>When WatchDog Timer 0 is activated, this bit indicates state 1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_CWDT0_ENABLED</name>
              <description>When Code WatchDog Timer 0 is activated, this bit indicates state 1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_ELS_GDET_ENABLED</name>
              <description>When either GDET is enabled, this bit indicates state 1.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_ANA_GDET_RESET_ENABLED</name>
              <description>When SPC analog glitch detect reset is enabled, this bit indicates state 1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_ANA_GDET_IRQ_ENABLED</name>
              <description>When SPC analog glitch detect IRQ is enabled, this bit indicates state 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_TAMPER_DET_ENABLED</name>
              <description>When tamper detector is enabled in TDET, this bit indicates state 1.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_LVD_VSYS_RESET_ENABLED</name>
              <description>When SPC VSYS LVD analog detector are turned on and VSYS LVD reset are enabled, this bit indicates state 1.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_LVD_VDDIO_RESET_ENABLED</name>
              <description>When SPC VDDIO LVD analog detector are turned on and VDDIO LVD reset are enabled, this bit indicates state 1.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_LVD_VSYS_IRQ_ENABLED</name>
              <description>When SPC VSYS LVD analog detector are turned on and VSYS LVD irq are enabled, this bit indicates state 1.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_LVD_VDDIO_IRQ_ENABLED</name>
              <description>When SPC VDDIO LVD analog detector are turned on and VDDIO LVD irq are enabled, this bit indicates state 1.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_WDT1_ENABLED</name>
              <description>When WatchDog Timer 1 is activated, this bit indicates state 1.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_CWDT1_ENABLED</name>
              <description>When Code WatchDog Timer 1 is activated, this bit indicates state 1.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_TEMPTAMPER_DET_ENABLED</name>
              <description>When temperature tamper detector is enabled in VBAT, this bit indicates state 1.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_VOLTAMPER_DET_ENABLED</name>
              <description>When voltage tamper detector is enabled in VBAT, this bit indicates state 1.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_LHTTAMPER_DET_ENABLED</name>
              <description>When light tamper detector is enabled in VBAT, this bit indicates state 1.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_CLKTAMPER_DET_ENABLED</name>
              <description>When clk tamper detector is enabled in VBAT, this bit indicates state 1.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_QK_DISABLE_ENROLL</name>
              <description>When QK PUF &quot;qk_disable_enroll&quot; input is driven 1, this bit indicates state 1</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_QK_DISABLE_WRAP</name>
              <description>When QK PUF &quot;qk_disable_wrap&quot; input is driven 1, this bit indicates state 1</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELS_AS_CFG1</name>
          <description>ELS AS Configuration1</description>
          <addressOffset>0x9D4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x140002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFG_SEC_DIS_STRICT_MODE</name>
              <description>When CFG_SEC_ENA_SEC_CHK indicates state 0 or when DISABLE_STRICT_MODE bits in MISC_CTRL_REG and MISC_CTRL_DP_REG on the AHB secure controller are equal to 01, this bit indicates state 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_SEC_DIS_VIOL_ABORT</name>
              <description>When the DISABLE_VIOLATION_ABORT bits in MISC_CTRL_REG and MISC_CTRL_DP_REG on the AHB secure controller are not equal to 10, this bit indicates state 1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_SEC_ENA_NS_PRIV_CHK</name>
              <description>When the ENABLE_NS_PRIV_CHECK bits in MISC_CTRL_REG and MISC_CTRL_DP_REG on the AHB secure controller are not equal to 10, this bit indicates state 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_SEC_ENA_S_PRIV_CHK</name>
              <description>When the ENABLE_S_PRIV_CHECK bits in MISC_CTRL_REG and MISC_CTRL_DP_REG on the AHB secure controller are not equal to 10, this bit indicates state 1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_SEC_ENA_SEC_CHK</name>
              <description>When the ENABLE_SECURE_CHECKING bits in MISC_CTRL_REG and MISC_CTRL_DP_REG on the AHB secure controller are not equal to 10, this bit indicates state 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_SEC_IDAU_ALLNS</name>
              <description>When the IDAU_ALL_NS bits in MISC_CTRL_REG and MISC_CTRL_DP_REG on the AHB secure controller are equal to 01, this bit indicates state 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_SEC_LOCK_NS_MPU</name>
              <description>When the LOCK_NS_MPU bits in CPU0_LOCK_REG on the AHB secure controller are not equal to 10, this bit indicates state 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_SEC_LOCK_NS_VTOR</name>
              <description>When the LOCK_NS_VTOR bits in CPU0_LOCK_REG on the AHB secure controller are not equal to 10, this bit indicates state 1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_SEC_LOCK_S_MPU</name>
              <description>When the LOCK_S_MPU bits in CPU0_LOCK_REG on the AHB secure controller are not equal to 10, this bit indicates state 1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_SEC_LOCK_S_VTAIRCR</name>
              <description>When the LOCK_S_VTAIRCR bits in CPU0_LOCK_REG on the AHB secure controller are not equal to 10, this bit indicates state 1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_SEC_LOCK_SAU</name>
              <description>When the LOCK_SAU bits in CPU0_LOCK_REG on the AHB secure controller are not equal to 10, this bit indicates state 1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>METAL_VERSION</name>
              <description>metal version</description>
              <bitOffset>13</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ROM_PATCH_VERSION</name>
              <description>ROM patch version</description>
              <bitOffset>21</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_HVD_CORE_RESET_ENABLED</name>
              <description>When SPC CORE HVD analog detector are turned on, and CORE HVD reset are enabled, this bit indicates state 1.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_HVD_CORE_IRQ_ENABLED</name>
              <description>When SPC CORE HVD analog detector are turned on, and CORE HVD IRQ are enabled, this bit indicates state 1.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_HVD_VSYS_RESET_ENABLED</name>
              <description>When SPC VSYS HVD analog detector are turned on and VSYS HVD reset are enabled, this bit indicates state 1.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_HVD_VDDIO_RESET_ENABLED</name>
              <description>When SPC VDDIO HVD analog detector are turned on and VDDIO HVD reset are enabled, this bit indicates state 1.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_HVD_VSYS_IRQ_ENABLED</name>
              <description>When SPC VSYS HVD analog detector are turned on and VSYS HVD irq are enabled, this bit indicates state 1.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_HVD_VDDIO_IRQ_ENABLED</name>
              <description>When SPC VDDIO HVD analog detector are turned on and VDDIO HVD irq are enabled, this bit indicates state 1.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELS_AS_CFG2</name>
          <description>ELS AS Configuration2</description>
          <addressOffset>0x9D8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFG_ELS_CMD_EN</name>
              <description>ELS configuration command enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELS_AS_CFG3</name>
          <description>ELS AS Configuration3</description>
          <addressOffset>0x9DC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DEVICE_TYPE</name>
              <description>Device type identification data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELS_AS_ST0</name>
          <description>ELS AS State Register</description>
          <addressOffset>0x9E0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ST_TEMPORAL_STATE</name>
              <description>TEMPORAL_STATE[3:0] in the ELS_TEMPORAL_STATE register reflects this register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_CPU0_DBGEN</name>
              <description>When CPU0 (CM33) &quot;deben&quot; input is state 1, this bit indicates state 1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_CPU0_NIDEN</name>
              <description>When CPU0 (CM33) &quot;niden&quot; input is state 1, this bit indicates state 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_CPU0_SPIDEN</name>
              <description>When CPU0 (CM33) &quot;spiden&quot; input is state 1, this bit indicates state 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_CPU0_SPNIDEN</name>
              <description>When CPU0 (CM33) &quot;spniden&quot; input is state 1, this bit indicates state 1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_CPU1_DBGEN</name>
              <description>When CPU1 (CM33) &quot;deben&quot; input is state 1, this bit indicates state 1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_CPU1_NIDEN</name>
              <description>When CPU1 (CM33) &quot;niden&quot; input is state 1, this bit indicates state 1.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_DAP_ENABLE_CPU0</name>
              <description>When DAP to AP0 for CPU0 (CM33) debug access is allowed, this bit indicates state 1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_DAP_ENABLE_CPU1</name>
              <description>When DAP to AP1 for CPU1 (CM33) debug access is allowed, this bit indicates state 1.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_DAP_ENABLE_DSP</name>
              <description>When DAP to AP3 for DSP (CoolFlux) debug access is allowed, this bit indicates state 1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_ALLOW_TEST_ACCESS</name>
              <description>When JTAG TAP access is allowed, this bit indicates state 1.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_XO32K_FAILED</name>
              <description>When XO32K oscillation fail flag is state 1, this bit indicates state 1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_XO40M_FAILED</name>
              <description>When XO40M oscillation fail flag is state 1, this bit indicates state 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_IFR_LOAD_FAILED</name>
              <description>When IFR load fail flag is state 1, this bit indicates state 1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_GLITCH_DETECT_FLAG</name>
              <description>GLITCH_DETECT_FLAG is state of 4-bit Glitch Ripple Counter output.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
