nxp-mcuxpresso/mcux-soc-svd/MCXN526T/MCXN526T_cm33_core1.xml
        <register>
          <name>DER</name>
          <description>DMA Enable</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EMPTY_DMAEN</name>
              <description>FIFO Empty DMA Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WM_DMAEN</name>
              <description>FIFO Watermark DMA Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RCR</name>
          <description>Reset Control</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOFTWARE_RESET</name>
                  <description>Software reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFORST</name>
              <description>FIFO Reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFO_RESET</name>
                  <description>FIFO reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TCR</name>
          <description>Trigger Control</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWTRG</name>
              <description>Software Trigger</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_VALID</name>
                  <description>Not valid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCR</name>
          <description>Periodic Trigger Control</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PTG_NUM</name>
              <description>Periodic Trigger Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PTG_PERIOD</name>
              <description>Periodic Trigger Period Width</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PORT0</name>
      <description>PORT</description>
      <groupName>PORT</groupName>
      <baseAddress>0x40116000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PORT_EFT</name>
        <value>148</value>
      </interrupt>
      <registers>
        <register>
          <name>VERID</name>
          <description>Version ID</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x2000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FEATURE</name>
              <description>Feature Specification Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>feature0</name>
                  <description>Basic implementation</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MINOR</name>
              <description>Minor Version Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>Major Version Number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPCLR</name>
          <description>Global Pin Control Low</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPWD</name>
              <description>Global Pin Write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPWE0</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE1</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE2</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE3</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE4</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE5</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE6</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE7</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE8</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE9</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE10</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE11</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE12</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE13</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE14</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE15</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
